07_Policies_Security/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins="http://insurance.acme.org/"
 xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:policy-security-saml="urn:switchyard-quickstart-demo:policy-security-saml:0.1.0">
    <soapenv:Header>
        <wsse:Security>
            <!-- Assertion -->
        </wsse:Security>
    </soapenv:Header>
   <soapenv:Body>
      <ins:createPolicyQuote>
         <policyQuote>
            <age>35</age>
            <creditScore>5</creditScore>
            <dlNumber>111111111</dlNumber>
            <driverName>David</driverName>
            <numberOfAccidents>1</numberOfAccidents>
            <numberOfTickets>1</numberOfTickets>
            <policyQuoteID>3</policyQuoteID>
            <policyType>AUTO</policyType>
            <price>2000</price>
            <requestDate>2013-01-09</requestDate>
            <ssn>12345</ssn>
            <vehicleYear>2009</vehicleYear>
         </policyQuote>
      </ins:createPolicyQuote>
   </soapenv:Body>
</soapenv:Envelope>
